Revit 2027 API
ParameterTypeId.FabricationPartWeight Property
 "Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartWeight { get; }
Public Shared ReadOnly Property FabricationPartWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartWeight {
	ForgeTypeId^ get ();
}
static member FabricationPartWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace